Revit 2027 API
Subelement.UniqueId Property
 A stable unique identifier for this subelement within the document.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string UniqueId { get; }
Public ReadOnly Property UniqueId As String
	Get
public:
property String^ UniqueId {
	String^ get ();
}
member UniqueId : string with get
Property Value
String
See Also
Reference
Subelement Class
Autodesk.Revit.DB Namespace